       01  COLOR-LIST.
           05  BLACK   PIC 9(1) VALUE 0.
           05  BLUE    PIC 9(1) VALUE 1.
           05  GREEN   PIC 9(1) VALUE 2.
           05  CYAN    PIC 9(1) VALUE 3.
           05  RED     PIC 9(1) VALUE 4.
           05  MAGENTA PIC 9(1) VALUE 5.
           05  BROWN   PIC 9(1) VALUE 6.
           05  WHITE   PIC 9(1) VALUE 7. 