       01  FA-REC.
           05 FA-NEXT-PNTR      PIC 9(4).
           05 FA-AWARD-CODE     PIC 9(4).
           05 FA-AWARD-AMT      PIC 9999V99.
           05 FA-SF-PNTR        PIC 9(9).
           05 FA-RC-PNTR        PIC 9(4).
