       01  FA-DATA-REC.
           05  FA-AWARD-CODE PIC 9(4).
           05  FA-AWARD-AMNT PIC 9(4)V99.
           05  FA-STU-NUM PIC 9(9).
           05  FA-NEXT-PNTR  PIC 9(5).
