       IDENTIFICATION DIVISION.
      *PROGRAM-ID. PRINT-STUDENT-MASTER.CBL.
      *CALEB STEVENS.
      *20160314.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SF-FILE-DESC ASSIGN TO
              'J:\CIS334\NETCLASS-NEW\PROJ-STU-FILE.DAT'
              ORGANIZATION IS INDEXED
              ACCESS IS DYNAMIC
              RECORD KEY IS SF-STU-NUM.
       SELECT REPORT-FILE ASSING TO
              'J:\CIS334\NETCLASS-NEW\STUDENT-MASTER.RPT'
              ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  SF-FILE-DESC IS EXTERNAL.
           RECORD CONTAINS 63 CHARACTERS.
       FD  REPORT-FILE.
       01  PRINT-REC.
       WORKING-STORAGE SECTION.
       01  ARE-THERE-MORE-RECORDS PIC X VALUE 'Y'.
       01  ANSWER PIC X VALUE SPACES.
       COPY SF-FILE-DESC.
       01  STUDENT-MASTER-REC.
           05  SF-STU-NUM PIC 9(9).
           05  FILLER     PIC X(5).
           05  SF-NAME    PIC X(10).
           05  FILLER     PIC X(5).
           05  SF-ADDRESS PIC X(10).
           05  FILLER     PIC X(5).
           05  SF-PHONE   PIC 9(10).
           05  FILLER     PIC X(5).
           05  SF-SSN     PIC *****9999.
           05  FILLER     PIC X(5).


