       IDENTIFICATION DIVISION.
      *PROGRAM-ID. PROJ-ENROLLMENT.CBL.
      *CALEB STEVENS.
      *20170403.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SF-FILE-DESC ASSIGN TO 'PROJ-STU-FILE.DAT'
              ORGANIZATION IS INDEXED
              ACCESS IS DYNAMIC
              RECORD KEY IS SF-STU-NUM.
       SELECT EF-FILE-DES ASSIGN TO 'PROJ-ENR.REL'
              ORGANIZATION IS RELATIVE
              ACCESS IS DYNAMIC
              RELATIVE KEY IS X.
       SELECT CLS-SECT ASSIGN TO 'PROJ-CLASS-SECT.DAT'
              ORGANIZATION IS INDEXED
              ACCESS IS DYNAMIC
              RECORD KEY IS LINE-NUM.
       DATA DIVISION.
       FILE SECTION.
       FD  SF-FILE-DESC IS EXTERNAL.
           RECORD CONTAINS 63 CHARACTERS.
       FD  EF-FILE-DES.
       01  EF-RECORD PIC X(18).
       FD  CLS-SECT IS EXTERNAL.
           RECORD CONTAINS 18 CHARACTERS.
       WORKING-STORAGE SECTION.
       01  ARE-THERE-MORE-RECORDS PIC X VALUE 'Y'.
       01  X PIC 9(3).
       01  EOF-REC.
           05  EOF-POINTER PIC 9(4).
           05  FILLER      PIC X(13).
       01  ENR-REC.
           05 RF-STUDENT-NUM   PIC X(9).
           05 RF-CRN           PIC X(4).
           05 RF-NXT-CLS-PNTR  PIC 9(5).
       01  WS-SF-RECORD.
           05  WS-SF-STU-NUM      PIC 9(9).
           05  FILLER             PIC X(39).
           05  WS-SF-ENR-REC-PNTR PIC 9(5).
           05  FILLER             PIC X(10).
       01  WS-TMP-LINE-NUM     PIC X(4).
       01  WS-TMP-CRN          PIC X(8).
       01  WS-TMP-EOF-PNTR     PIC 9(5).
       COPY CLS-SECT.
       COPY SF-FILE-DESC.
       COPY COLORS.
       SCREEN SECTION.
       01  BLANK-SCREEN.
           05  BLANK SCREEN.
       01  SCREEN-ENROLLMENT-INFO.
           05  BLANK SCREEN.
           05  BACKGROUND-COLOR WHITE FOREGROUND-COLOR BLUE HIGHLIGHT.
           05  LINE 2  COLUMN 15 VALUE 'STUDENT INFO:'.
           05  LINE 3  COLUMN 15 VALUE 'STUDENT NUMBER: '.
           05  LINE 3  COLUMN 31 PIC 9(9) FROM SF-STU-NUM.
           05  LINE 4  COLUMN 15 VALUE '-------------------------'.
           05  LINE 5  COLUMN 15 VALUE 'STUDENT NAME: '.
           05  LINE 5  COLUMN 29 PIC X(10) FROM SF-NAME.
           05  LINE 8  COLUMN 15 VALUE 'ENTER LINE NUMBER: '.
           05  LINE 8  COLUMN 34 PIC X(5) TO WS-TMP-LINE-NUM.
           05  LINE 11 COLUMN 15 VALUE 'ENTER COURSE NUMBER: '.
           05  LINE 11 COLUMN 36 PIC X(8) TO WS-TMP-COURSE-NUM.
       PROCEDURE DIVISION USING SF-STU-NUM.
       100-MAIN-MODULE.
           OPEN INPUT EF-FILE-DES
           CLOSE EF-FILE-DES
           OPEN INPUT SF-FILE-DESC
           PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'N'
               MOVE SPACES TO SF-RECORD
      *        DISPLAY BLANK-SCREEN
      *        DISPLAY 'ENTER STUDENT NUMBER: '
               ACCEPT SF-STU-NUM
               READ SF-FILE-DESC
                 INVALID KEY PERFORM 200-STUDENT-ROUTINE
                 NOT INVALID KEY PERFORM 300-ENROLL-ROUTINE
               END-READ
           END-PERFORM
           CLOSE SF-FILE-DESC
           STOP RUN.
       300-ENROLL-ROUTINE.
           DISPLAY SCREEN-ENROLLMENT-INFO
           ACCEPT SCREEN-ENROLLMENT-INFO
           DISPLAY BLANK-SCREEN.
           MOVE SPACES TO EF-RECORD
           OPEN I-O EF-FILE-DES
           MOVE 1 TO X
           READ EF-FILE-DES
           MOVE EF-RECORD TO EOF-REC
           MOVE EOF-POINTER TO WS-TMP-EOF-PNTR
           ADD 1 TO EOF-POINTER
           REWRITE EF-RECORD FROM EOF-REC
           IF SF-ENR-REC-PNTR > 0 THEN
             MOVE SF-ENR-REC-PNTR TO X
             READ EF-FILE-DES
             MOVE EF-RECORD TO ENR-REC
             DISPLAY 'STUDENT CLASSES: '
             PERFORM UNTIL RF-NXT-CLS-PNTR = 0
               MOVE RF-NXT-CLS-PNTR TO X
               READ EF-FILE-DES
               MOVE EF-RECORD TO ENR-REC
               DISPLAY 'LINE NUMBER:   ', RF-LINE-NUMBER
               DISPLAY 'COURSE NUMBER: ', RF-COURSE-NUMBER
               DISPLAY ' '
             END-PERFORM
             MOVE WS-TMP-EOF-PNTR TO RF-NXT-CLS-PNTR
             REWRITE EF-RECORD FROM ENR-REC
           ELSE
             CLOSE SF-FILE-DESC
             OPEN I-O SF-FILE-DESC
             MOVE SF-RECORD TO WS-SF-RECORD
             MOVE WS-TMP-EOF-PNTR TO WS-SF-ENR-REC-PNTR
             REWRITE SF-RECORD FROM WS-SF-RECORD
             CLOSE SF-FILE-DESC
             OPEN INPUT SF-FILE-DESC
           END-IF
           MOVE WS-TMP-EOF-PNTR TO X
           MOVE WS-TMP-LINE-NUM TO RF-LINE-NUMBER
           MOVE WS-TMP-COURSE-NUM TO RF-COURSE-NUMBER
           MOVE ZERO TO RF-NXT-CLS-PNTR
           WRITE EF-RECORD FROM ENR-REC
           DISPLAY 'LINE NUMBER:   ', RF-LINE-NUMBER
           DISPLAY 'COURSE NUMBER: ', RF-COURSE-NUMBER
           DISPLAY ' '
           DISPLAY 'ENTER ANOTHER STUDENT OR MORE CLASSES? '
           ACCEPT ARE-THERE-MORE-RECORDS
           CLOSE EF-FILE-DES.
