       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJ-ADD-CLASS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CS-FILE-DESC ASSIGN TO 'PROJ-CLASS-SECT.DAT'
              ORGANIZATION IS INDEXED
              ACCESS IS DYNAMIC
              RECORD KEY IS CS-CRN.
       DATA DIVISION.
       FILE SECTION.
       FD  CS-FILE-DESC IS EXTERNAL RECORD CONTAINS 23 CHARACTERS.
       COPY CS-SECT.
       WORKING-STORAGE SECTION.
       01  ARE-THERE-MORE-RECORDS PIC X VALUE 'Y'.
       01  WS-CS-RECORD.
           05  WS-CS-CRN-NUM      PIC 9(5).
           05  WS-COURSE-NUM      PIC X(6).
           05  WS-COURSE-DESC     PIC X(10).
           05  WS-CRED-HOURS      PIC 9(2).
       COPY COLORS.
       01  WS-CRN PIC 9(5) VALUE 0.
       01  ANS    PIC X.
       SCREEN SECTION.
       01  BLANK-SCREEN.
           05  BLANK SCREEN.
       01  SCREEN-NEW-CLASS.
           05  BLANK SCREEN.
           05  BACKGROUND-COLOR WHITE FOREGROUND-COLOR BLUE HIGHLIGHT.
           05  LINE 2  COLUMN 15 VALUE 'ADD NEW CLASS INFO:'.
           05  LINE 3  COLUMN 15 VALUE 'CRN NUMBER: '.
           05  LINE 3  COLUMN 31 PIC 9(5) TO CS-CRN.
           05  LINE 4  COLUMN 15 VALUE '-------------------------'.
           05  LINE 5  COLUMN 15 VALUE 'ENTER COURSE CODE: '.
           05  LINE 5  COLUMN 35 PIC X(6) TO CS-CRS-CODE.
           05  LINE 8  COLUMN 15 VALUE 'ENTER COURSE DESCRIPT: '.
           05  LINE 8  COLUMN 39 PIC X(10) TO CS-DESC.
           05  LINE 11 COLUMN 15 VALUE 'ENTER CREDIT HOURS: '.
           05  LINE 11 COLUMN 35 PIC 9(2) TO CS-CRED-HR.
       01  MORE-CLASSES.
           05 BLANK SCREEN.
           05 LINE 2 COLUMN 15 VALUE 'CLASS ADDED SUCCESSFULLY'.
           05 LINE 4 COLUMN 15 VALUE 'MORE CLASSES TO ADD? '.
           05 LINE 4 COLUMN 37 PIC X TO ARE-THERE-MORE-RECORDS.
       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT CS-FILE-DESC
           PERFORM UNTIL ARE-THERE-MORE-RECORDS = 'N' OR 'n'
               MOVE SPACES TO CS-SECT-REC
               MOVE WS-CRN TO CS-CRN
               READ CS-FILE-DESC
               INVALID KEY PERFORM 200-CLASS-ROUTINE
               NOT INVALID KEY PERFORM 300-EXISTING-ROUTINE
               END-READ
               DISPLAY MORE-CLASSES
               ACCEPT MORE-CLASSES
           END-PERFORM
           DISPLAY BLANK-SCREEN
           CLOSE CS-FILE-DESC
           EXIT PROGRAM.
       200-CLASS-ROUTINE.
           DISPLAY SCREEN-NEW-CLASS
           ACCEPT SCREEN-NEW-CLASS
           MOVE CS-SECT-REC TO WS-CS-RECORD
           CLOSE CS-FILE-DESC
           OPEN I-O CS-FILE-DESC
           WRITE CS-SECT-REC FROM WS-CS-RECORD
           CLOSE CS-FILE-DESC
           OPEN INPUT CS-FILE-DESC.
       300-EXISTING-ROUTINE.
           DISPLAY BLANK-SCREEN
           DISPLAY 'CLASS ALREADY EXISTS'
           DISPLAY 'HIT ENTER TO GO BACK TO MAIN SCREEN'
           ACCEPT ANS.
