       01 TUITION-RATE  PIC 9(3)V99 VALUE 100.
       01 BOOKS-FEE     PIC 9(3)V99 VALUE 50.
       01 SCHOLARSHIPS.
           05 SPORTS-SCHOLARSHIP PIC 9(4) VALUE 1000.
           05 MUSIC-SCHOLARSHIP  PIC 9(4) VALUE 500.
           05 HONORS-SCHOLARSHIP PIC 9(4) VALUE 700.
       01 TICKETS.
           05 PARKING-TICKET     PIC 9(3) VALUE 50.
           05 LIBRARY-TICKET     PIC 9(3) VALUE 25.
