       IDENTIFICATION DIVISION.
      *PROGRAM-ID. PROJ-ADD-STUDENT.CBL.
      *CALEB STEVENS.
      *20170403.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT SF-FILE-DESC ASSIGN TO 'PROJ-STU-FILE.DAT'
              ORGANIZATION IS INDEXED
              ACCESS IS DYNAMIC
              RECORD KEY IS SF-STU-NUM.
       DATA DIVISION.
       FILE SECTION.
       FD  SF-FILE-DESC IS EXTERNAL.
           RECORD CONTAINS 63 CHARACTERS.
       WORKING-STORAGE SECTION.
       01  ARE-THERE-MORE-RECORDS PIC X VALUE 'Y'.
       01  WS-SF-RECORD.
           05  WS-SF-STU-NUM      PIC 9(9).
           05  FILLER             PIC X(39).
           05  WS-SF-ENR-REC-PNTR PIC 9(5).
           05  FILLER             PIC X(10).
       COPY SF-FILE-DESC.
       COPY COLORS.
       SCREEN SECTION.
       01  BLANK-SCREEN.
           05  BLANK SCREEN.
       01  SCREEN-NEW-STUDENT.
           05  BLANK SCREEN.
           05  BACKGROUND-COLOR WHITE FOREGROUND-COLOR BLUE HIGHLIGHT.
           05  LINE 2  COLUMN 15 VALUE 'ADD NEW STUDENT INFO:'.
           05  LINE 3  COLUMN 15 VALUE 'STUDENT NUMBER: '.
           05  LINE 3  COLUMN 31 PIC 9(9) FROM SF-STU-NUM.
           05  LINE 4  COLUMN 15 VALUE '-------------------------'.
           05  LINE 5  COLUMN 15 VALUE 'ENTER STUDENT NAME: '.
           05  LINE 5  COLUMN 35 PIC X(10) TO SF-NAME.
           05  LINE 8  COLUMN 15 VALUE 'ENTER STUDENT ADDRESS: '.
           05  LINE 8  COLUMN 38 PIC X(10) TO SF-ADDRESS.
           05  LINE 11 COLUMN 15 VALUE 'ENTER STUDENT PHONE: '.
           05  LINE 11 COLUMN 35 PIC 9(10) TO SF-PHONE.
           05  LINE 14 COLUMN 15 VALUE 'ENTER STUDENT SOCIAL: '.
           05  LINE 14 COLUMN 38 PIC 9(9) TO SF-SSN.
       PROCEDURE DIVISION USING SF-STU-NUM.
       100-MAIN-MODULE.
           OPEN INPUT SF-FILE-DESC
           MOVE SPACES TO SF-RECORD
           ACCEPT SF-STU-NUM
           READ SF-FILE-DESC
             INVALID KEY PERFORM 200-STUDENT-ROUTINE
             NOT INVALID KEY DISPLAY 'STUDENT EXISTS'
           END-READ
           END-PERFORM
           CLOSE SF-FILE-DESC
           EXIT PROGRAM.
       200-STUDENT-ROUTINE.
           DISPLAY SCREEN-NEW-STUDENT
           ACCEPT SCREEN-NEW-STUDENT
           CLOSE SF-FILE-DESC
           OPEN I-O SF-FILE-DESC
           MOVE ZERO TO SF-ENR-REC-PNTR
           WRITE SF-RECORD
           CLOSE SF-FILE-DESC
           OPEN INPUT SF-FILE-DESC.
