       01  RC-REC.
           05 RC-TYPE           PIC X(10).
           05 RC-STU-NUM        PIC 9(9).
           05 RC-AMT-OWED       PIC 9(4)V99.
           05 RC-AMT-PAID       PIC 9(4)V99.
           05 RC-NEXT-PNTR      PIC 9(4).
