       01  RC-REC.
           05 RC-NEXT-PNTR      PIC 9(4).
           05 RC-LAST-PNTR      PIC 9(4).
           05 RC-AMT-OWED       PIC 9(4)V99.
           05 RC-AMT-PAID       PIC 9(4)V99.
           05 RC-SF-PNTR        PIC 9(9).
