       01  SF-RECORD.
           05  SF-STU-NUM PIC 9(9).
           05  SF-NAME    PIC X(10).
           05  SF-ADDRESS PIC X(10).
           05  SF-PHONE   PIC 9(10).
           05  SF-SSN     PIC 9(9).
           05  SF-FIN-AID-PNTR PIC 9(5).
           05  SF-RCT-REC-PNTR PIC 9(5).
           05  SF-ENR-REC-PNTR PIC 9(5).
